{
  "url": "/docs/Introduction/About",
  "title": "About",
  "text": "\n\nMain aim of this project - make useful library for simplify development of high quality UI on web technologies.This library give you platform to development good components and provides ready-made components which you can use as you wish, for example replace some features to your own or use features from this components in your own components. You have full control on features which you use.Main goal of components architecture it's be liquid and make components which easy extends, not force to use unnecessary features and can be easy replace like constructor details.For web developers this platform allows only once a make components or build it from parts and use everywhere.\n\nProject inspired by yandex-ui and influenced by React Spectrum and Base Web React Components.yandex-ui is really good implementation of BEM methodology on react.\nThis project get many ideas from yandex-ui and most important it's architecture which split component to essencess which is independent. Many components created by drawings of yandex-ui and improved. Also yandex-ui influenced to state management of this library. Different of \"React Spectrum\", components of this library is not have own state, instead this state is public and keep outside, but component managed state by request new state with hooks (mean callbacks and not react hooks).React Spectrum it's general sponsor of idea about move all common behavior to hooks.\"Base Web React Components\" library have good structure of components and exemplary documentation.Also thanks to BEM community and yarastqt to help with understand BEM.\n\nHelp to make internet better, tell about this library to other developers. If they start use this or similar library, they got tools which help them make sites with pretty and acessible interfaces by default and we will become closer to future where this UI attributes is absoluteley minimum and default, due to implementation of this cost nothing. To make web better purpose, this matter not less than security of personal data or access to many filters while search something."
}